espressif/esp-idf/components/soc/esp32c5/register/soc/lp_apm_reg.h
/** LP_APM_REGION4_ATTR_REG register
 *  Region access permissions configuration register
 */
#define LP_APM_REGION4_ATTR_REG (DR_REG_LP_APM_BASE + 0x3c)
/** LP_APM_REGION4_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution permission in region 4 in REE0 mode.
 */
#define LP_APM_REGION4_R0_X    (BIT(0))
#define LP_APM_REGION4_R0_X_M  (LP_APM_REGION4_R0_X_V << LP_APM_REGION4_R0_X_S)
#define LP_APM_REGION4_R0_X_V  0x00000001U
#define LP_APM_REGION4_R0_X_S  0
/** LP_APM_REGION4_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write permission in region 4 in REE0 mode.
 */
#define LP_APM_REGION4_R0_W    (BIT(1))
#define LP_APM_REGION4_R0_W_M  (LP_APM_REGION4_R0_W_V << LP_APM_REGION4_R0_W_S)
#define LP_APM_REGION4_R0_W_V  0x00000001U
#define LP_APM_REGION4_R0_W_S  1
/** LP_APM_REGION4_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read permission in region 4 in REE0 mode.
 */
#define LP_APM_REGION4_R0_R    (BIT(2))
#define LP_APM_REGION4_R0_R_M  (LP_APM_REGION4_R0_R_V << LP_APM_REGION4_R0_R_S)
#define LP_APM_REGION4_R0_R_V  0x00000001U
#define LP_APM_REGION4_R0_R_S  2
/** LP_APM_REGION4_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution permission in region 4 in REE1 mode.
 */
#define LP_APM_REGION4_R1_X    (BIT(4))
#define LP_APM_REGION4_R1_X_M  (LP_APM_REGION4_R1_X_V << LP_APM_REGION4_R1_X_S)
#define LP_APM_REGION4_R1_X_V  0x00000001U
#define LP_APM_REGION4_R1_X_S  4
/** LP_APM_REGION4_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write permission in region 4 in REE1 mode.
 */
#define LP_APM_REGION4_R1_W    (BIT(5))
#define LP_APM_REGION4_R1_W_M  (LP_APM_REGION4_R1_W_V << LP_APM_REGION4_R1_W_S)
#define LP_APM_REGION4_R1_W_V  0x00000001U
#define LP_APM_REGION4_R1_W_S  5
/** LP_APM_REGION4_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read permission in region 4 in REE1 mode.
 */
#define LP_APM_REGION4_R1_R    (BIT(6))
#define LP_APM_REGION4_R1_R_M  (LP_APM_REGION4_R1_R_V << LP_APM_REGION4_R1_R_S)
#define LP_APM_REGION4_R1_R_V  0x00000001U
#define LP_APM_REGION4_R1_R_S  6
/** LP_APM_REGION4_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution permission in region 4 in REE1 mode.
 */
#define LP_APM_REGION4_R2_X    (BIT(8))
#define LP_APM_REGION4_R2_X_M  (LP_APM_REGION4_R2_X_V << LP_APM_REGION4_R2_X_S)
#define LP_APM_REGION4_R2_X_V  0x00000001U
#define LP_APM_REGION4_R2_X_S  8
/** LP_APM_REGION4_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write permission in region 4 in REE2 mode.
 */
#define LP_APM_REGION4_R2_W    (BIT(9))
#define LP_APM_REGION4_R2_W_M  (LP_APM_REGION4_R2_W_V << LP_APM_REGION4_R2_W_S)
#define LP_APM_REGION4_R2_W_V  0x00000001U
#define LP_APM_REGION4_R2_W_S  9
/** LP_APM_REGION4_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read permission in region 4 in REE2 mode.
 */
#define LP_APM_REGION4_R2_R    (BIT(10))
#define LP_APM_REGION4_R2_R_M  (LP_APM_REGION4_R2_R_V << LP_APM_REGION4_R2_R_S)
#define LP_APM_REGION4_R2_R_V  0x00000001U
#define LP_APM_REGION4_R2_R_S  10
/** LP_APM_REGION4_LOCK : R/W; bitpos: [11]; default: 0;
 *  Configures to lock the value of region 4 configuration registers
 *  (LP_APM_REGION4_ADDR_START_REG, LP_APM_REGION4_ADDR_END_REG and
 *  LP_APM_REGION4_ATTR_REG).
 *  0: Do not lock
 *  1: Lock
 */
#define LP_APM_REGION4_LOCK    (BIT(11))
#define LP_APM_REGION4_LOCK_M  (LP_APM_REGION4_LOCK_V << LP_APM_REGION4_LOCK_S)
#define LP_APM_REGION4_LOCK_V  0x00000001U
#define LP_APM_REGION4_LOCK_S  11

/** LP_APM_REGION5_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM_REGION5_ADDR_START_REG (DR_REG_LP_APM_BASE + 0x40)
/** LP_APM_REGION5_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of region 5.
 */
#define LP_APM_REGION5_ADDR_START    0xFFFFFFFFU
#define LP_APM_REGION5_ADDR_START_M  (LP_APM_REGION5_ADDR_START_V << LP_APM_REGION5_ADDR_START_S)
#define LP_APM_REGION5_ADDR_START_V  0xFFFFFFFFU
#define LP_APM_REGION5_ADDR_START_S  0

/** LP_APM_REGION5_ADDR_END_REG register
 *  Region address register
 */
#define LP_APM_REGION5_ADDR_END_REG (DR_REG_LP_APM_BASE + 0x44)
/** LP_APM_REGION5_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures the end address of region 5.
 */
#define LP_APM_REGION5_ADDR_END    0xFFFFFFFFU
#define LP_APM_REGION5_ADDR_END_M  (LP_APM_REGION5_ADDR_END_V << LP_APM_REGION5_ADDR_END_S)
#define LP_APM_REGION5_ADDR_END_V  0xFFFFFFFFU
#define LP_APM_REGION5_ADDR_END_S  0

/** LP_APM_REGION5_ATTR_REG register
 *  Region access permissions configuration register
 */
#define LP_APM_REGION5_ATTR_REG (DR_REG_LP_APM_BASE + 0x48)
/** LP_APM_REGION5_R0_X : R/W; bitpos: [0]; default: 0;
 *  Configures the execution permission in region 5 in REE0 mode.
 */
#define LP_APM_REGION5_R0_X    (BIT(0))
#define LP_APM_REGION5_R0_X_M  (LP_APM_REGION5_R0_X_V << LP_APM_REGION5_R0_X_S)
#define LP_APM_REGION5_R0_X_V  0x00000001U
#define LP_APM_REGION5_R0_X_S  0
/** LP_APM_REGION5_R0_W : R/W; bitpos: [1]; default: 0;
 *  Configures the write permission in region 5 in REE0 mode.
 */
#define LP_APM_REGION5_R0_W    (BIT(1))
#define LP_APM_REGION5_R0_W_M  (LP_APM_REGION5_R0_W_V << LP_APM_REGION5_R0_W_S)
#define LP_APM_REGION5_R0_W_V  0x00000001U
#define LP_APM_REGION5_R0_W_S  1
/** LP_APM_REGION5_R0_R : R/W; bitpos: [2]; default: 0;
 *  Configures the read permission in region 5 in REE0 mode.
 */
#define LP_APM_REGION5_R0_R    (BIT(2))
#define LP_APM_REGION5_R0_R_M  (LP_APM_REGION5_R0_R_V << LP_APM_REGION5_R0_R_S)
#define LP_APM_REGION5_R0_R_V  0x00000001U
#define LP_APM_REGION5_R0_R_S  2
/** LP_APM_REGION5_R1_X : R/W; bitpos: [4]; default: 0;
 *  Configures the execution permission in region 5 in REE1 mode.
 */
#define LP_APM_REGION5_R1_X    (BIT(4))
#define LP_APM_REGION5_R1_X_M  (LP_APM_REGION5_R1_X_V << LP_APM_REGION5_R1_X_S)
#define LP_APM_REGION5_R1_X_V  0x00000001U
#define LP_APM_REGION5_R1_X_S  4
/** LP_APM_REGION5_R1_W : R/W; bitpos: [5]; default: 0;
 *  Configures the write permission in region 5 in REE1 mode.
 */
#define LP_APM_REGION5_R1_W    (BIT(5))
#define LP_APM_REGION5_R1_W_M  (LP_APM_REGION5_R1_W_V << LP_APM_REGION5_R1_W_S)
#define LP_APM_REGION5_R1_W_V  0x00000001U
#define LP_APM_REGION5_R1_W_S  5
/** LP_APM_REGION5_R1_R : R/W; bitpos: [6]; default: 0;
 *  Configures the read permission in region 5 in REE1 mode.
 */
#define LP_APM_REGION5_R1_R    (BIT(6))
#define LP_APM_REGION5_R1_R_M  (LP_APM_REGION5_R1_R_V << LP_APM_REGION5_R1_R_S)
#define LP_APM_REGION5_R1_R_V  0x00000001U
#define LP_APM_REGION5_R1_R_S  6
/** LP_APM_REGION5_R2_X : R/W; bitpos: [8]; default: 0;
 *  Configures the execution permission in region 5 in REE1 mode.
 */
#define LP_APM_REGION5_R2_X    (BIT(8))
#define LP_APM_REGION5_R2_X_M  (LP_APM_REGION5_R2_X_V << LP_APM_REGION5_R2_X_S)
#define LP_APM_REGION5_R2_X_V  0x00000001U
#define LP_APM_REGION5_R2_X_S  8
/** LP_APM_REGION5_R2_W : R/W; bitpos: [9]; default: 0;
 *  Configures the write permission in region 5 in REE2 mode.
 */
#define LP_APM_REGION5_R2_W    (BIT(9))
#define LP_APM_REGION5_R2_W_M  (LP_APM_REGION5_R2_W_V << LP_APM_REGION5_R2_W_S)
#define LP_APM_REGION5_R2_W_V  0x00000001U
#define LP_APM_REGION5_R2_W_S  9
/** LP_APM_REGION5_R2_R : R/W; bitpos: [10]; default: 0;
 *  Configures the read permission in region 5 in REE2 mode.
 */
#define LP_APM_REGION5_R2_R    (BIT(10))
#define LP_APM_REGION5_R2_R_M  (LP_APM_REGION5_R2_R_V << LP_APM_REGION5_R2_R_S)
#define LP_APM_REGION5_R2_R_V  0x00000001U
#define LP_APM_REGION5_R2_R_S  10
/** LP_APM_REGION5_LOCK : R/W; bitpos: [11]; default: 0;
 *  Configures to lock the value of region 5 configuration registers
 *  (LP_APM_REGION5_ADDR_START_REG, LP_APM_REGION5_ADDR_END_REG and
 *  LP_APM_REGION5_ATTR_REG).
 *  0: Do not lock
 *  1: Lock
 */
#define LP_APM_REGION5_LOCK    (BIT(11))
#define LP_APM_REGION5_LOCK_M  (LP_APM_REGION5_LOCK_V << LP_APM_REGION5_LOCK_S)
#define LP_APM_REGION5_LOCK_V  0x00000001U
#define LP_APM_REGION5_LOCK_S  11

/** LP_APM_REGION6_ADDR_START_REG register
 *  Region address register
 */
#define LP_APM_REGION6_ADDR_START_REG (DR_REG_LP_APM_BASE + 0x4c)
/** LP_APM_REGION6_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Configures the start address of region 6.
 */
#define LP_APM_REGION6_ADDR_START    0xFFFFFFFFU
#define LP_APM_REGION6_ADDR_START_M  (LP_APM_REGION6_ADDR_START_V << LP_APM_REGION6_ADDR_START_S)
#define LP_APM_REGION6_ADDR_START_V  0xFFFFFFFFU
#define LP_APM_REGION6_ADDR_START_S  0

