espressif/esp-idf/components/soc/esp32c5/register/soc/lp_apm_reg.h
/** LP_APM_M1_STATUS_REG register
 *  LP_APM_CTRL M1 status register
 */
#define LP_APM_M1_STATUS_REG (DR_REG_LP_APM_BASE + 0xd8)
/** LP_APM_M1_EXCEPTION_STATUS : RO; bitpos: [1:0]; default: 0;
 *  Represents exception status.
 *  bit0: 1 represents permission restrictions
 *  bit1: 1 represents address out of bounds
 */
#define LP_APM_M1_EXCEPTION_STATUS    0x00000003U
#define LP_APM_M1_EXCEPTION_STATUS_M  (LP_APM_M1_EXCEPTION_STATUS_V << LP_APM_M1_EXCEPTION_STATUS_S)
#define LP_APM_M1_EXCEPTION_STATUS_V  0x00000003U
#define LP_APM_M1_EXCEPTION_STATUS_S  0

/** LP_APM_M1_STATUS_CLR_REG register
 *  LP_APM_CTRL M1 status clear register
 */
#define LP_APM_M1_STATUS_CLR_REG (DR_REG_LP_APM_BASE + 0xdc)
/** LP_APM_M1_EXCEPTION_STATUS_CLR : WT; bitpos: [0]; default: 0;
 *  Configures to clear exception status.
 */
#define LP_APM_M1_EXCEPTION_STATUS_CLR    (BIT(0))
#define LP_APM_M1_EXCEPTION_STATUS_CLR_M  (LP_APM_M1_EXCEPTION_STATUS_CLR_V << LP_APM_M1_EXCEPTION_STATUS_CLR_S)
#define LP_APM_M1_EXCEPTION_STATUS_CLR_V  0x00000001U
#define LP_APM_M1_EXCEPTION_STATUS_CLR_S  0

/** LP_APM_M1_EXCEPTION_INFO0_REG register
 *  LP_APM_CTRL M1 exception information register
 */
#define LP_APM_M1_EXCEPTION_INFO0_REG (DR_REG_LP_APM_BASE + 0xe0)
/** LP_APM_M1_EXCEPTION_REGION : RO; bitpos: [7:0]; default: 0;
 *  Represents the region where an exception occurs.
 */
#define LP_APM_M1_EXCEPTION_REGION    0x000000FFU
#define LP_APM_M1_EXCEPTION_REGION_M  (LP_APM_M1_EXCEPTION_REGION_V << LP_APM_M1_EXCEPTION_REGION_S)
#define LP_APM_M1_EXCEPTION_REGION_V  0x000000FFU
#define LP_APM_M1_EXCEPTION_REGION_S  0
/** LP_APM_M1_EXCEPTION_MODE : RO; bitpos: [17:16]; default: 0;
 *  Represents the master's security mode when an exception occurs.
 */
#define LP_APM_M1_EXCEPTION_MODE    0x00000003U
#define LP_APM_M1_EXCEPTION_MODE_M  (LP_APM_M1_EXCEPTION_MODE_V << LP_APM_M1_EXCEPTION_MODE_S)
#define LP_APM_M1_EXCEPTION_MODE_V  0x00000003U
#define LP_APM_M1_EXCEPTION_MODE_S  16
/** LP_APM_M1_EXCEPTION_ID : RO; bitpos: [22:18]; default: 0;
 *  Represents master ID when an exception occurs.
 */
#define LP_APM_M1_EXCEPTION_ID    0x0000001FU
#define LP_APM_M1_EXCEPTION_ID_M  (LP_APM_M1_EXCEPTION_ID_V << LP_APM_M1_EXCEPTION_ID_S)
#define LP_APM_M1_EXCEPTION_ID_V  0x0000001FU
#define LP_APM_M1_EXCEPTION_ID_S  18

/** LP_APM_M1_EXCEPTION_INFO1_REG register
 *  LP_APM_CTRL M1 exception information register
 */
#define LP_APM_M1_EXCEPTION_INFO1_REG (DR_REG_LP_APM_BASE + 0xe4)
/** LP_APM_M1_EXCEPTION_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents the access address when an exception occurs.
 */
#define LP_APM_M1_EXCEPTION_ADDR    0xFFFFFFFFU
#define LP_APM_M1_EXCEPTION_ADDR_M  (LP_APM_M1_EXCEPTION_ADDR_V << LP_APM_M1_EXCEPTION_ADDR_S)
#define LP_APM_M1_EXCEPTION_ADDR_V  0xFFFFFFFFU
#define LP_APM_M1_EXCEPTION_ADDR_S  0

/** LP_APM_INT_EN_REG register
 *  LP_APM_CTRL M0/1 interrupt enable register
 */
#define LP_APM_INT_EN_REG (DR_REG_LP_APM_BASE + 0xe8)
/** LP_APM_M0_APM_INT_EN : R/W; bitpos: [0]; default: 0;
 *  Configures to enable LP_APM_CTRL M0 interrupt.
 *  0: Disable
 *  1: Enable
 */
#define LP_APM_M0_APM_INT_EN    (BIT(0))
#define LP_APM_M0_APM_INT_EN_M  (LP_APM_M0_APM_INT_EN_V << LP_APM_M0_APM_INT_EN_S)
#define LP_APM_M0_APM_INT_EN_V  0x00000001U
#define LP_APM_M0_APM_INT_EN_S  0
/** LP_APM_M1_APM_INT_EN : R/W; bitpos: [1]; default: 0;
 *  Configures to enable LP_APM_CTRL M1 interrupt.
 *  0: Disable
 *  1: Enable
 */
#define LP_APM_M1_APM_INT_EN    (BIT(1))
#define LP_APM_M1_APM_INT_EN_M  (LP_APM_M1_APM_INT_EN_V << LP_APM_M1_APM_INT_EN_S)
#define LP_APM_M1_APM_INT_EN_V  0x00000001U
#define LP_APM_M1_APM_INT_EN_S  1

/** LP_APM_CLOCK_GATE_REG register
 *  Clock gating register
 */
#define LP_APM_CLOCK_GATE_REG (DR_REG_LP_APM_BASE + 0xec)
/** LP_APM_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Configures whether to keep the clock always on.
 *  0: Enable automatic clock gating
 *  1: Keep the clock always on
 */
#define LP_APM_CLK_EN    (BIT(0))
#define LP_APM_CLK_EN_M  (LP_APM_CLK_EN_V << LP_APM_CLK_EN_S)
#define LP_APM_CLK_EN_V  0x00000001U
#define LP_APM_CLK_EN_S  0

/** LP_APM_DATE_REG register
 *  Version control register
 */
#define LP_APM_DATE_REG (DR_REG_LP_APM_BASE + 0xfc)
/** LP_APM_DATE : R/W; bitpos: [27:0]; default: 35725664;
 *  Version control register.
 */
#define LP_APM_DATE    0x0FFFFFFFU
#define LP_APM_DATE_M  (LP_APM_DATE_V << LP_APM_DATE_S)
#define LP_APM_DATE_V  0x0FFFFFFFU
#define LP_APM_DATE_S  0

#ifdef __cplusplus
}
#endif
